In [1]:
person = {
    "first": ["Hari", "Carey"],
    "last": ["Aineri", "Schafer"],
    "email": ["HariAineri@gmail.com", "CareySchafer@gmail.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(person)

In [4]:
df

   first     last                   email
0   Hari   Aineri    HariAineri@gmail.com
1  Carey  Schafer  CareySchafer@gmail.com

In [31]:
people = [
    {'name': 'Hari', 'age': 34},
    {'name': 'Nikhitha', 'age': 26},
    {'name': 'Hari', 'age': 33},
    {'name': 'Nikhitha', 'age': 26}
]

In [32]:
df = pd.DataFrame(people)

In [10]:
df

       name  age
0      Hari   34
1  Nikhitha   36
2      Hari   34

In [16]:
df['name'].duplicated()
ids = df['name']

In [33]:
df[ids.isin(ids[ids.duplicated()])].sort_values("name")

   name  age
0  Hari   34
2  Hari   33

In [15]:
df[ids.isin(ids[ids.duplicated()])]

   name  age
0  Hari   34
2  Hari   34

In [19]:
ids[ids.duplicated()]

2    Hari
Name: name, dtype: object

In [18]:
ids

0        Hari
1    Nikhitha
2        Hari
Name: name, dtype: object

In [30]:
len(df[ids.isin(ids[ids.duplicated()])].sort_values("name"))

2